beholf/app/Views/rapat/detail_rapat.php

<?php
$route = service('uri')->getSegment(1);
$formModel = new \App\Models\M_form();
$form = $formModel->where('route', $route)->where('status_delete', 0)->first();
---
SELECT *
FROM `el_form`
WHERE `route` = 'rapat'
AND `status_delete` = 0
 LIMIT 1

$can_approve = 0;
if ($form) {
    $groupFormModel = new \App\Models\M_group_form();
    $perm = $groupFormModel->where('id_form', $form['id_form'])->where('id_level', session()->get('level'))->where('status_delete', 0)->first();
---
SELECT *
FROM `el_group_form`
WHERE `id_form` = '1'
AND `id_level` = '4'
AND `status_delete` = 0
 LIMIT 1