beholf/app/Models/M_form.php

    public function getDeletedForms()
{
    $result = $this->db->table('el_form')
                      ->where('status_delete', 1)
                      ->get()
                      ->getResultArray();
---
SELECT *
FROM `el_form`
WHERE `status_delete` = 1