beholf/app/Models/M_group_form.php

SELECT *
FROM `el_group_form`
WHERE `id_level` = '1'
AND `status_delete` = 0
---
    public function getPermissionsByLevel($id_level)
    {
        return $this->where('id_level', $id_level)->where('status_delete', 0)->findAll();

SELECT `el_group_form`.*, `el_form`.`deskripsi`, `el_form`.`route`, `el_form`.`jenis_form`, `el_form`.`icon`
FROM `el_group_form`
JOIN `el_form` ON `el_form`.`id_form` = `el_group_form`.`id_form`
WHERE `el_group_form`.`id_level` = '4'
AND `el_group_form`.`status_delete` = 0
AND `el_form`.`status_delete` = 0
---
    public function getFormsByLevel($id_level)
    {
        return $this->select('el_group_form.*, el_form.deskripsi, el_form.route, el_form.jenis_form, el_form.icon')
                    ->join('el_form', 'el_form.id_form = el_group_form.id_form')
                    ->where('el_group_form.id_level', $id_level)
                    ->where('el_group_form.status_delete', 0)
                    ->where('el_form.status_delete', 0)
                    ->findAll();