beholf/app/Models/M_hak_akses_user.php

SELECT *
FROM `el_hak_akses_user`
WHERE `status_delete` = 1
---
    public function getDeletedUserAccess()
{
    $result = $this->db->table('el_hak_akses_user')
                      ->where('status_delete', 1)
                      ->get()
                      ->getResultArray();