beholf/app/Models/M_level.php

SELECT *
FROM `el_level`
WHERE `status_delete` = 1
---
    public function getDeletedLevels()
    {
        $result = $this->db->table('el_level')
            ->where('status_delete', 1)
            ->get()
            ->getResultArray();