beholf/app/Models/M_log.php

    public function getAllLogs()
    {
        return $this->select('el_log_activity.*, el_user.username')
                    ->join('el_user', 'el_user.id_user = el_log_activity.id_user', 'left')
                    ->orderBy('happens_at', 'DESC')
                    ->findAll();
---
SELECT `el_log_activity`.*, `el_user`.`username`
FROM `el_log_activity`
LEFT JOIN `el_user` ON `el_user`.`id_user` = `el_log_activity`.`id_user`
ORDER BY `happens_at` DESC