beholf/app/Models/M_note_highlight.php

SELECT *
FROM `note_highlights`
WHERE `note_id` = 2
ORDER BY `created_at` ASC
---
    public function getByNote(int $noteId): array
    {
        return $this->where('note_id', $noteId)->orderBy('created_at', 'ASC')->findAll();