beholf/app/Models/M_note_structure.php

    public function getByNote(int $noteId): ?array
    {
        return $this->where('note_id', $noteId)->first();
---
SELECT *
FROM `note_structures`
WHERE `note_id` = 2
 LIMIT 1