beholf/app/Models/M_peserta.php

    public function getPesertaByRapat($id_note)
    {
        return $this->select('el_user.username, el_divisi.nama_divisi')
                    ->join('el_user', 'el_user.id_user = el_peserta.id_user')
                    ->join('el_divisi', 'el_divisi.id_divisi = el_user.divisi', 'left')
                    ->where('el_peserta.id_note', $id_note)
                    ->findAll();
---
SELECT `el_user`.`username`, `el_divisi`.`nama_divisi`
FROM `el_peserta`
JOIN `el_user` ON `el_user`.`id_user` = `el_peserta`.`id_user`
LEFT JOIN `el_divisi` ON `el_divisi`.`id_divisi` = `el_user`.`divisi`
WHERE `el_peserta`.`id_note` = '2'