beholf/app/Models/M_rapat.php

SELECT *
FROM `el_notes`
WHERE `el_notes`.`id_note` = '2'
---
    public function deletePermanen($id)
    {
        return $this->where('id_note', $id)->delete();