beholf/app/Models/M_term_definition.php

    public function findCached(string $term): ?array
    {
        return $this->where('term', $term)->orderBy('created_at', 'DESC')->first();
---
SELECT *
FROM `note_term_definitions`
WHERE `term` = 'iklim'
ORDER BY `created_at` DESC
 LIMIT 1

    public function getByNote(int $noteId): array
    {
        return $this->where('note_id', $noteId)->orderBy('term', 'ASC')->findAll();
---
SELECT *
FROM `note_term_definitions`
WHERE `note_id` = 2
ORDER BY `term` ASC

    public function saveDefinition(array $data): int|string
    {
        $data['created_at'] = date('Y-m-d H:i:s');
        return $this->insert($data, true);
---
INSERT INTO `note_term_definitions` (`note_id`, `term`, `simple_definition`, `technical_definition`, `source_type`, `created_at`) VALUES (2, 'iklim', 'iklim is the Indonesian word for climate, referring to the atmospheric conditions in a particular region.', 'Iklim is a term used in climatology to describe the average atmospheric conditions in a specific region or area, encompassing temperature, humidity, and precipitation patterns over a long period.', 'ai', '2026-04-11 20:55:43')