beholf/app/Models/M_web_detail.php

SELECT *
FROM `el_web_detail`
 LIMIT 1
---
    public function getWebDetail()
    {
        return $this->first();