beholf/app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `el_user`
SELECT COUNT(*) AS `numrows`
FROM `el_rapat`
SELECT `el_user`.`username`, `el_level`.`nama_level`
FROM `el_user`
LEFT JOIN `el_level` ON `el_level`.`id_level` = `el_user`.`level`
WHERE `el_user`.`id_user` = '36'
 LIMIT 1
---
    public function index()
    {
        if (session()->get('id_user') > 0) {
            $userModel = new M_user();
            $rapatModel = new M_rapat();
            $transkripModel = new M_transkrip();

            $totalUser = $userModel->countAllResults();
            $totalRapat = $rapatModel->countAllResults();
            $totalTranskrip = $transkripModel->countAllResults();

            $idUser = session()->get('id_user');
            $username = session()->get('username');

            // ambil level user berdasarkan id_user
            $userData = $userModel->select('el_user.username, el_level.nama_level')
                ->join('el_level', 'el_level.id_level = el_user.level', 'left')
                ->where('el_user.id_user', $idUser)
                ->first();