beholf/app/Controllers/HakAkses.php

    public function index()
    {
        if (session()->get('id_user') > 0) {
            $M_form = new M_form();
            $M_level = new M_level();
            $M_user = new M_user();
            $M_hak_akses_user = new M_hak_akses_user();

            $data = [
                'title' => 'Hak Akses',
                'forms' => $M_form->where('status_delete', 0)->findAll(),
                'levels' => $M_level->where('status_delete', 0)->findAll(),
                'users' => $M_user->where('status_delete', 0)->findAll(),
                'user_levels' => $M_hak_akses_user->where('status_delete', 0)->findAll(),
---
SELECT *
FROM `el_form`
WHERE `status_delete` = 0
SELECT *
FROM `el_level`
WHERE `status_delete` = 0
SELECT *
FROM `el_user`
WHERE `status_delete` = 0
SELECT *
FROM `el_hak_akses_user`
WHERE `status_delete` = 0

    public function tambah_level_permission()
    {
        if (session()->get('id_user') > 0) {
            $M_level = new M_level();
            $M_form = new M_form();

            $data = [
                'title' => 'Buat Level dan Assign Permission',
                'levels' => $M_level->where('status_delete', 0)->findAll(),
                'forms' => $M_form->where('status_delete', 0)->findAll()
---
SELECT *
FROM `el_level`
WHERE `status_delete` = 0
SELECT *
FROM `el_form`
WHERE `status_delete` = 0