beholf/app/Controllers/LogActivity.php

    public function index()
    {
        if (session()->get('id_user') > 0) {
            $M_log = new M_log();
            $user_level = session()->get('level');

            // Check permissions for log_activity
            $M_form = new M_form();
            $M_group_form = new M_group_form();
            $form = $M_form->where('route', 'log_activity')->where('status_delete', 0)->first();
            $can_create = 0;
            if ($form) {
                $perm = $M_group_form->where('id_form', $form['id_form'])->where('id_level', $user_level)->where('status_delete', 0)->first();
---
SELECT *
FROM `el_form`
WHERE `route` = 'log_activity'
AND `status_delete` = 0
 LIMIT 1
SELECT *
FROM `el_group_form`
WHERE `id_form` = '6'
AND `id_level` = '4'
AND `status_delete` = 0
 LIMIT 1