beholf/app/Controllers/Login.php

SELECT *
FROM `el_user`
WHERE `username` = 'Elysia'
 LIMIT 1
---
    public function aksi_login()
    {
        $username = $this->request->getPost('usn');
        $password = $this->request->getPost('pswd');
        $recaptcha_response = $this->request->getPost('g-recaptcha-response');
        $math_answer = $this->request->getPost('math_answer');
        $correct_answer = $this->request->getPost('correct_answer');

        $connected = @fsockopen("www.google.com", 80);

        if ($connected) {
            fclose($connected);

            $recaptcha_secret = "6LeZQekqAAAAAIk1nT3Xbz4KcKFyZ4Uk51w8m1b4";
            $verify_url = "https://www.google.com/recaptcha/api/siteverify";
            $response = file_get_contents($verify_url . "?secret=" . $recaptcha_secret . "&response=" . $recaptcha_response);
            $response_keys = json_decode($response, true);

            if (!$response_keys["success"]) {
                return redirect()->back()->with('error', 'reCAPTCHA verification failed. Please try again.');
            }
        } else {
            if ($math_answer === null || $correct_answer === null || (int) $math_answer !== (int) $correct_answer) {
                return redirect()->back()->with('error', 'Verifikasi matematika salah. Coba lagi.');
            }
        }

        $M_user = new \App\Models\M_user();
        $user = $M_user->where('username', $username)->first();