beholf/app/Controllers/Rapat.php

    public function index()
    {
        if (session()->get('id_user') > 0) {
            $M_rapat = new M_rapat();
            $M_peserta = new M_peserta();
            $M_form = new M_form();
            $M_group_form = new M_group_form();

            $user_id = session()->get('id_user');
            $user_level = session()->get('level');
            $can_create = 0;

            // 🔍 Cek hak akses pada form "rapat"
            $form = $M_form->where('route', 'rapat')->where('status_delete', 0)->first();
            if ($form) {
                $perm = $M_group_form
                    ->where('id_form', $form['id_form'])
                    ->where('id_level', $user_level)
                    ->where('status_delete', 0)
                    ->first();

                if ($perm && $perm['can_create'] == 1) {
                    $can_create = 1;
                }
            }

            // 🔸 Ambil data rapat sesuai hak akses
            if ($can_create) {
                // Jika punya hak akses penuh (lihat semua)
                $rapat = $M_rapat->select('el_notes.*, el_category.name AS category_name, el_category.color AS category_color, el_category.icon AS category_icon')
                    ->join('el_category', 'el_notes.category = el_category.id_category', 'left')
                    ->where('el_notes.status_delete', 0)
                    ->asObject()
                    ->findAll();
---
SELECT *
FROM `el_form`
WHERE `route` = 'rapat'
AND `status_delete` = 0
 LIMIT 1
SELECT *
FROM `el_group_form`
WHERE `id_form` = '1'
AND `id_level` = '4'
AND `status_delete` = 0
 LIMIT 1
SELECT `el_notes`.*, `el_category`.`name` AS `category_name`, `el_category`.`color` AS `category_color`, `el_category`.`icon` AS `category_icon`
FROM `el_notes`
LEFT JOIN `el_category` ON `el_notes`.`category` = `el_category`.`id_category`
WHERE `el_notes`.`status_delete` = 0

    public function detail_rapat($id)
    {
        if (session()->get('id_user') > 0) {
            $M_transkrip = new M_transkrip();
            $M_rapat = new M_rapat();
            $M_peserta = new M_peserta();
            $rapat = $M_rapat->getRapatById($id);
            $peserta = $M_peserta->getPesertaByRapat($id);
            $transkrip = $M_transkrip
                ->select('el_note_transcripts.*, el_user.username')
                ->join('el_user', 'el_user.id_user = el_note_transcripts.id_user', 'left')
                ->where('id_note', $id)
                ->orderBy('waktu_upload', 'DESC')
                ->findAll();
---
SELECT `el_note_transcripts`.*, `el_user`.`username`
FROM `el_note_transcripts`
LEFT JOIN `el_user` ON `el_user`.`id_user` = `el_note_transcripts`.`id_user`
WHERE `id_note` = '2'
ORDER BY `waktu_upload` DESC