beholf/app/Controllers/Reminder.php

SELECT `el_rapat`.*, `el_peserta`.`id_user`
FROM `el_rapat`
JOIN `el_peserta` ON `el_peserta`.`id_rapat` = `el_rapat`.`id_rapat`
WHERE `el_peserta`.`id_user` = '36'
AND `el_rapat`.`tanggal` >= '2026-01-20 10:12:43'
AND `el_rapat`.`tanggal` <= '2026-01-20 22:07:43'
AND `el_rapat`.`status_delete` = 0
---
    public function sendMeetingReminders($userId = null)
    {
        // If no userId provided, get from session
        if (!$userId) {
            $userId = session()->get('id_user');
        }

        if (!$userId) {
            return false;
        }

        $M_rapat = new M_rapat();
        $M_peserta = new M_peserta();
        $M_user = new M_user();

        // Get current time in WIB (since database stores WIB time)
        $nowWIB = date('Y-m-d H:i:s', time() + (7 * 3600)); // Add 7 hours for WIB
        $twelveHoursFromNowWIB = date('Y-m-d H:i:s', time() + (7 * 3600) + (12 * 3600));
        $fiveMinutesFromNowWIB = date('Y-m-d H:i:s', time() + (7 * 3600) + (5 * 60));

        // Find meetings within 12 hours that this user is participating in AND haven't started yet
        // Only send reminders for meetings more than 5 minutes in the future
        $meetings = $M_rapat->select('el_notes.*, el_peserta.id_user')
            ->join('el_peserta', 'el_peserta.id_note = el_notes.id_note')
            ->where('el_peserta.id_user', $userId)
            ->where('el_notes.tanggal >=', $fiveMinutesFromNowWIB)  // Meeting is at least 5 minutes in the future (WIB)
            ->where('el_notes.tanggal <=', $twelveHoursFromNowWIB)  // Within 12 hours (WIB)
            ->where('el_notes.status_delete', 0)
            ->findAll();