beholf/app/Views/menu.php

SELECT *
FROM `el_user`
WHERE `id_user` = '36'
 LIMIT 1
---
                        $id_user = $session->get('id_user');

                        $userModel = new \App\Models\M_user();
                        $user = $userModel->where('id_user', $id_user)->first();